In [1]:
import streamlit as st
import  numpy as np
import  pandas as pd
import time

In [3]:
df = pd.DataFrame({
    "1列目": [1, 2, 3, 4],
    "2列目": [10, 20, 30, 40]
})

df

   1列目  2列目
0    1   10
1    2   20
2    3   30
3    4   40

In [13]:
df["1列目"]

0    1
1    2
2    3
3    4
Name: 1列目, dtype: int64

In [16]:
df2 = pd.DataFrame(
    np.random.rand(20, 3),
    columns = ["a", "b", "c"]
)
df2

           a         b         c
0   0.125847  0.496390  0.002162
1   0.522251  0.064304  0.758412
2   0.184230  0.622914  0.746885
3   0.554729  0.711339  0.486936
4   0.518037  0.675325  0.220434
5   0.641493  0.219103  0.416346
6   0.958240  0.136783  0.321733
7   0.452895  0.785678  0.982247
8   0.276735  0.197352  0.922594
9   0.148980  0.096764  0.502785
10  0.434903  0.036164  0.343088
11  0.854081  0.898063  0.642025
12  0.329371  0.480907  0.614492
13  0.357789  0.729943  0.121787
14  0.429884  0.950094  0.142680
15  0.089743  0.861240  0.316959
16  0.016788  0.736640  0.754955
17  0.573097  0.570786  0.614989
18  0.340456  0.774978  0.542882
19  0.035775  0.273049  0.088050

In [6]:
df3 = pd.DataFrame(
    np.random.rand(100, 2)/[50, 50] + [35.69, 139.70],
    columns = ["lat", "lon"]
)
df3

          lat         lon
0   35.690116  139.714124
1   35.700363  139.717974
2   35.703049  139.703935
3   35.694252  139.702281
4   35.692952  139.703333
..        ...         ...
95  35.708520  139.703429
96  35.708374  139.711097
97  35.703744  139.712154
98  35.703979  139.718531
99  35.693125  139.700887

[100 rows x 2 columns]

In [7]:
list(range(1,11))

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [8]:
list(range(1,12))

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]

In [6]:
for i in range(20):
    print(i)
    time.sleep(0.05)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19

In [8]:
random = np.random.rand()
random

0.14326457388048397